app/controllers/api/thermostats_controller.rb

SELECT  `thermostats`.* FROM `thermostats` WHERE `thermostats`.`id` = 1 LIMIT 1
SELECT `readings`.* FROM `readings` WHERE `readings`.`thermostat_id` = 1
---
    def show
      thermostat = Thermostat.includes(:readings).find(params[:id])