app/controllers/application_controller.rb

SELECT  `thermostats`.* FROM `thermostats` WHERE `thermostats`.`household_token` = '13baceb6e464d3e7823ebfb3004228c2' LIMIT 1
---
  def authenticate_token!
    thermostat = Thermostat.find_by_household_token(request_token)